Revit 2018 API
FabricationPartBrowserOperation Enumeration
 Operations for the FabricationPartBrowserChangedEventArgs Event
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public enum FabricationPartBrowserOperation
Visual Basic
Public Enumeration FabricationPartBrowserOperation
Visual C++
public enum class FabricationPartBrowserOperation
Members
Member name | Description
UnknownOperation |  Unknown operation
ShowBrowser |  Show browser window
HideBrowser |  Hide browser window
ShowService |  Select current service
StartRoutingSolutionMode |  Start routing solution mode
CreatedRoutingSolutions |  Routing solutions (re)created
RoutingSolutionChanged |  Active Routing solution has changed
FinishRoutingSolutionMode |  Finish routing solution mode
StartMPRoutingMode |  Start multi-point routing mode
FinishMPRoutingMode |  Finish multi-point routing mode
See Also
Autodesk.Revit.UI.Events Namespace